
# Условие
# Выведите все четные элементы списка. При этом используйте цикл for, перебирающий элементы списка, а не их индексы!

# Входные данные	Правильный ответ
# 1 2 2 3 3 3 4
# 2 2 4

# 1 2 3 4 5
# 2 4

# 2 4 6 8
# 2 4 6 8

# 1 1 1 1 1 1 2
# 2

# 44 -51 32 -60 -7 -67 62 91 26 -14
# 44 32 -60 62 26 -14

# 32 -95 -78 -15 -71 -73 -83 53 -91 -82 -71 -52 -60 -18 12 8 98 -92 -83 7
# 32 -78 -82 -52 -60 -18 12 8 98 -92

# 39 55 -88 56 -39 -92 -30 54 15 94 27 -87 -85 -53 -44 -87 33 38 -22 56
# -88 56 -92 -30 54 94 -44 38 -22 56


a = input().split()

for i in a:
    if (int(i) % 2) == 0:
        print(i, end=' ')
